RhinoInside.Revit API Documentation
GeometryEncoder.ToBoundingBoxXYZ Method (BoundingBox)
 Converts the specified BoundingBox to an equivalent Revit BoundingBoxXYZ.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8018
Syntax
public static Autodesk.Revit.DB.BoundingBoxXYZ ToBoundingBoxXYZ(
	this Rhino.Geometry.BoundingBox value
)
Parameters
value
Type: Rhino.Geometry.BoundingBox
A value to convert.
Return Value
Type: Autodesk.Revit.DB.BoundingBoxXYZ
A Revit BoundingBoxXYZ that is equivalent to the provided value.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Rhino.Geometry.BoundingBox. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
GeometryEncoder Class
ToBoundingBoxXYZ Overload
RhinoInside.Revit.Convert.Geometry Namespace